wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_rcu.c
/*!
    \file    gd32g5x3_rcu.c
    \brief   RCU driver

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32g5x3_rcu.h"

/* define clock source */
#define SEL_IRC8M                    ((uint16_t)0U)                /* IRC8M is selected as CK_SYS */
#define SEL_HXTAL                    ((uint16_t)1U)                /* HXTAL is selected as CK_SYS */
#define SEL_PLLP                     ((uint16_t)3U)                /* PLLP is selected as CK_SYS */
/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT          ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT        ((uint32_t)0x0FFFFFFFU)
/* RCU IRC8M adjust value mask and offset */
#define RCU_IRC8M_ADJUST_MASK        ((uint8_t)0x1FU)
#define RCU_IRC8M_ADJUST_OFFSET      ((uint32_t)3U)
/* RCU_PLLN, RCU_PLLP, RCU_PLLQ, RCU_PLLR offset */
#define RCU_PLLNOFFSET               ((uint32_t)6U)
#define RCU_PLLPOFFSET               ((uint32_t)16U)
#define RCU_PLLQOFFSET               ((uint32_t)23U)
#define RCU_PLLROFFSET               ((uint32_t)27U)

/* function to calculate the PLL output frequency */
static uint32_t rcu_pll_clock_freq_cal(uint32_t pllinputfreq, uint32_t pll_psc, uint32_t pll_n, uint32_t pll_pqr);

/*!
    \brief      deinitialize the RCU
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC8M */
    RCU_CTL |= RCU_CTL_IRC8MEN;
    while(0U == (RCU_CTL & RCU_CTL_IRC8MSTB)){
    }
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN);
    RCU_CTL &= ~(RCU_CTL_HXTALBPS);
    /* reset PLL register */
    RCU_PLL = 0x00000400U;
    /* reset INT register */
    RCU_INT = 0x109F0000U;
    /* reset CFG0 register */
    RCU_CFG0 = 0x00000000U;
    /* reset CFG1 register */
    RCU_CFG1 = 0x00000000U;
    /* reset CFG2 register */
    RCU_CFG2 = 0x00000000U;
}

/*!
    \brief      enable the peripherals clock
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_FFT: FFT clock
      \arg        RCU_CLA: CLA clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G): GPIO ports clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_FAC: FAC clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_TMU: TMU clock
      \arg        RCU_QSPI : QSPI clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_I2Cx (x = 0,1,2,3): I2C clock
      \arg        RCU_USARTx (x = 0,1,2): USART clock
      \arg        RCU_UARTx (x = 3,4): UART clock
      \arg        RCU_SPIx (x = 0,1,2): SPI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_LPTIMER: LPTIMER clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,14,15,16,19): TIMER clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_HRTIMER: HRTIMER clock
      \arg        RCU_HPDF: HPDF clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CANx (x = 0,1,2): can clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_VREF: VREF clock
      \arg        RCU_DACHOLD: DACHOLD clock
      \arg        RCU_DACx (x = 0,1,2,3): DAC clock
      \arg        RCU_ADCx (x = 0,1,2,3): ADC clock
      \arg        RCU_RTC: RTC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_FFT: FFT clock
      \arg        RCU_CLA: CLA clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G): GPIO ports clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_FAC: FAC clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_TMU: TMU clock
      \arg        RCU_QSPI : QSPI clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_I2Cx (x = 0,1,2,3): I2C clock
      \arg        RCU_USARTx (x = 0,1,2): USART clock
      \arg        RCU_UARTx (x = 3,4): UART clock
      \arg        RCU_SPIx (x = 0,1,2): SPI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_LPTIMER: LPTIMER clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,14,15,16,19): TIMER clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_HRTIMER: HRTIMER clock
      \arg        RCU_HPDF: HPDF clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CANx (x = 0,1,2): can clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_VREF: VREF clock
      \arg        RCU_DACHOLD: DACHOLD clock
      \arg        RCU_DACx (x = 0,1,2,3): DAC clock
      \arg        RCU_ADCx (x = 0,1,2,3): ADC clock
      \arg        RCU_RTC: RTC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the peripherals clock when sleep and deep-sleep mode
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx_SLP (x = 0,1): DMA clock
      \arg        RCU_DMAMUX_SLP: DMAMUX clock
      \arg        RCU_SRAMx_SLP (x = 0,1): SRAM clock
      \arg        RCU_TCMSRAM_SLP : TCMSRAM clock
      \arg        RCU_FFT_SLP: FFT clock
      \arg        RCU_CLA_SLP: CLA clock
      \arg        RCU_CRC_SLP: CRC clock
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,E,F,G): GPIO ports clock
      \arg        RCU_CAU_SLP: CAU clock
      \arg        RCU_FAC_SLP: FAC clock
      \arg        RCU_TRNG_SLP: TRNG clock
      \arg        RCU_TMU_SLP: TMU clock
      \arg        RCU_QSPI_SLP : QSPI clock
      \arg        RCU_EXMC_SLP: EXMC clock
      \arg        RCU_PMU_SLP: PMU clock
      \arg        RCU_I2Cx_SLP (x = 0,1,2,3): I2C clock
      \arg        RCU_USARTx_SLP (x = 0,1,2): USART clock
      \arg        RCU_UARTx_SLP (x = 3,4): UART clock
      \arg        RCU_SPIx_SLP (x = 0,1,2): SPI clock
      \arg        RCU_WWDGT_SLP: WWDGT clock
      \arg        RCU_LPTIMER_SLP: LPTIMER clock
      \arg        RCU_TIMERx_SLP (x = 0,1,2,3,4,5,6,7,14,15,16,19): TIMER clock
      \arg        RCU_TRIGSEL_SLP: TRIGSEL clock
      \arg        RCU_HRTIMER_SLP: HRTIMER clock
      \arg        RCU_HPDF_SLP: HPDF clock
      \arg        RCU_SYSCFG_SLP: SYSCFG clock
      \arg        RCU_CANx_SLP (x = 0,1,2): CAN clock
      \arg        RCU_CMP_SLP: CMP clock
      \arg        RCU_VREF_SLP: VREF clock
      \arg        RCU_DACHOLD_SLP: DACHOLD clock
      \arg        RCU_DACx_SLP (x = 0,1,2,3): DAC clock
      \arg        RCU_ADCx_SLP (x = 0,1,2,3): ADC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock when sleep and deep-sleep mode
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx_SLP (x = 0,1): DMA clock
      \arg        RCU_DMAMUX_SLP: DMAMUX clock
      \arg        RCU_SRAMx_SLP (x = 0,1): SRAM clock
      \arg        RCU_TCMSRAM_SLP : TCMSRAM clock
      \arg        RCU_FFT_SLP: FFT clock
      \arg        RCU_CLA_SLP: CLA clock
      \arg        RCU_CRC_SLP: CRC clock
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,E,F,G): GPIO ports clock
      \arg        RCU_CAU_SLP: CAU clock
      \arg        RCU_FAC_SLP: FAC clock
      \arg        RCU_TRNG_SLP: TRNG clock
      \arg        RCU_TMU_SLP: TMU clock
      \arg        RCU_QSPI_SLP : QSPI clock
      \arg        RCU_EXMC_SLP: EXMC clock
      \arg        RCU_PMU_SLP: PMU clock
      \arg        RCU_I2Cx_SLP (x = 0,1,2,3): I2C clock
      \arg        RCU_USARTx_SLP (x = 0,1,2): USART clock
      \arg        RCU_UARTx_SLP (x = 3,4): UART clock
      \arg        RCU_SPIx_SLP (x = 0,1,2): SPI clock
      \arg        RCU_WWDGT_SLP: WWDGT clock
      \arg        RCU_LPTIMER_SLP: LPTIMER clock
      \arg        RCU_TIMERx_SLP (x = 0,1,2,3,4,5,6,7,14,15,16,19): TIMER clock
      \arg        RCU_TRIGSEL_SLP: TRIGSEL clock
      \arg        RCU_HRTIMER_SLP: HRTIMER clock
      \arg        RCU_HPDF_SLP: HPDF clock
      \arg        RCU_SYSCFG_SLP: SYSCFG clock
      \arg        RCU_CANx_SLP (x = 0,1,2): CAN clock
      \arg        RCU_CMP_SLP: CMP clock
      \arg        RCU_VREF_SLP: VREF clock
      \arg        RCU_DACHOLD_SLP: DACHOLD clock
      \arg        RCU_DACx_SLP (x = 0,1,2,3): DAC clock
      \arg        RCU_ADCx_SLP (x = 0,1,2,3): ADC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      reset the peripherals
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAxRST (x = 0,1): reset DMA
      \arg        RCU_DMAMUXRST: reset DMAMUX
      \arg        RCU_FFTRST: reset FFT
      \arg        RCU_CLARST: reset CLA
      \arg        RCU_CRCRST: reset CRC
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G): reset GPIO ports
      \arg        RCU_CAURST: reset CAU
      \arg        RCU_FACRST: reset FAC
      \arg        RCU_TRNGRST: reset TRNG
      \arg        RCU_TMURST: reset TMU
      \arg        RCU_QSPIRST : reset QSPI
      \arg        RCU_EXMCRST: reset EXMC
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_I2CxRST (x = 0,1,2,3): reset I2C
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_UARTxRST (x = 3,4): reset UART
      \arg        RCU_SPIxRST (x = 0,1,2): reset SPI
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_LPTIMERRST: reset LPTIMER
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,14,15,16,19): reset TIMER
      \arg        RCU_TRIGSELRST: reset TRIGSEL
      \arg        RCU_HRTIMERRST: reset HRTIMER
      \arg        RCU_HPDFRST: reset HPDF
      \arg        RCU_SYSCFGRST: reset SYSCFG
      \arg        RCU_CANxRST (x = 0,1,2): reset CAN
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_VREFRST: reset VREF
      \arg        RCU_DACHOLDRST: reset DACHOLD
      \arg        RCU_DACxRST (x = 0,1,2,3): reset DAC
      \arg        RCU_ADCxRST (x = 0,1,2,3): reset ADC
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripheral
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAxRST (x = 0,1): reset DMA
      \arg        RCU_DMAMUXRST: reset DMAMUX
      \arg        RCU_FFTRST: reset FFT
      \arg        RCU_CLARST: reset CLA
      \arg        RCU_CRCRST: reset CRC
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G): reset GPIO ports
      \arg        RCU_CAURST: reset CAU
      \arg        RCU_FACRST: reset FAC
      \arg        RCU_TRNGRST: reset TRNG
      \arg        RCU_TMURST: reset TMU
      \arg        RCU_QSPIRST : reset QSPI
      \arg        RCU_EXMCRST: reset EXMC
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_I2CxRST (x = 0,1,2,3): reset I2C
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_UARTxRST (x = 3,4): reset UART
      \arg        RCU_SPIxRST (x = 0,1,2): reset SPI
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_LPTIMERRST: reset LPTIMER
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,14,15,16,19): reset TIMER
      \arg        RCU_TRIGSELRST: reset TRIGSEL
      \arg        RCU_HRTIMERRST: reset HRTIMER
      \arg        RCU_HPDFRST: reset HPDF
      \arg        RCU_SYSCFGRST: reset SYSCFG
      \arg        RCU_CANxRST (x = 0,1,2): reset CAN
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_VREFRST: reset VREF
      \arg        RCU_DACHOLDRST: reset DACHOLD
      \arg        RCU_DACxRST (x = 0,1,2,3): reset DAC
      \arg        RCU_ADCxRST (x = 0,1,2,3): reset ADC
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      reset the BKP
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_BKPRST;
}

/*!
    \brief      disable the BKP reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_BKPRST;
}

/*!
    \brief      configure the system clock source
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC8M: select CK_IRC8M as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_PLLP: select CK_PLLP as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG0_SCS;
    RCU_CFG0 = (reg | ck_sys);
}

/*!
    \brief      get the system clock source
    \param[in]  none
    \param[out] none
    \retval     which clock is selected as CK_SYS source
      \arg        RCU_SCSS_IRC8M: CK_IRC8M is selected as the CK_SYS source
      \arg        RCU_SCSS_HXTAL: CK_HXTAL is selected as the CK_SYS source
      \arg        RCU_SCSS_PLLP: CK_PLLP is selected as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    return (RCU_CFG0 & RCU_CFG0_SCSS);
}

/*!
    \brief      configure the AHB clock prescaler selection
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx (x = 1, 2, 4, 8, 16, 64, 128, 256, 512): CK_AHB is CK_SYS/x
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the AHBPSC bits and set according to ck_ahb */
    reg &= ~RCU_CFG0_AHBPSC;
    RCU_CFG0 = (reg | ck_ahb);
}

/*!
    \brief      configure the APB1 clock prescaler selection
    \param[in]  ck_apb1: APB1 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB1_CKAHB_DIV1: select CK_AHB as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV2: select CK_AHB / 2 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV4: select CK_AHB / 4 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV8: select CK_AHB / 8 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV16: select CK_AHB / 16 as CK_APB1
    \param[out] none
    \retval     none
*/
void rcu_apb1_clock_config(uint32_t ck_apb1)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB1PSC and set according to ck_apb1 */
    reg &= ~RCU_CFG0_APB1PSC;
    RCU_CFG0 = (reg | ck_apb1);
}

/*!
    \brief      configure the APB2 clock prescaler selection
    \param[in]  ck_apb2: APB2 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB2_CKAHB_DIV1: select CK_AHB as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV2: select CK_AHB / 2 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV4: select CK_AHB / 4 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV8: select CK_AHB / 8 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV16: select CK_AHB / 16 as CK_APB2
    \param[out] none
    \retval     none
*/
void rcu_apb2_clock_config(uint32_t ck_apb2)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB2PSC and set according to ck_apb2 */
    reg &= ~RCU_CFG0_APB2PSC;
    RCU_CFG0 = (reg | ck_apb2);
}

/*!
    \brief      configure the APB3 clock prescaler selection
    \param[in]  ck_apb3: APB3 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB3_CKAHB_DIV1: select CK_AHB as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV2: select CK_AHB / 2 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV4: select CK_AHB / 4 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV8: select CK_AHB / 8 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV16: select CK_AHB/ 16 as CK_APB3
    \param[out] none
    \retval     none
*/
void rcu_apb3_clock_config(uint32_t ck_apb3)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB3PSC and set according to ck_apb3 */
    reg &= ~RCU_CFG0_APB3PSC;
    RCU_CFG0 = (reg | ck_apb3);
}

/*!
    \brief      configure the CK_OUT clock source and divider
    \param[in]  ckout_src: CK_OUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUTSRC_IRC32K: IRC32K selected
      \arg        RCU_CKOUTSRC_LXTAL: LXTAL selected
      \arg        RCU_CKOUTSRC_CKSYS: systerm clock selected
      \arg        RCU_CKOUTSRC_IRC8M: IRC8M selected
      \arg        RCU_CKOUTSRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUTSRC_PLLP: PLLP selected
    \param[in]  ckout_div: CK_OUT divider
      \arg        RCU_CKOUT_DIVx (x = 1,2,4,8,16): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout_config(uint32_t ckout_src, uint32_t ckout_div)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the CKOUTSRC, CKOUTDIV and set according to ckout_src and ckout_div */
    reg &= ~(RCU_CFG0_CKOUTSEL | RCU_CFG0_CKOUTDIV);
    RCU_CFG0 = (reg | ckout_src | ckout_div);
}

/*!
    \brief      enable the low speed clock output
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lsckout_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_LSCKOUTEN;
}

/*!
    \brief      disable the low speed clock output
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lsckout_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_LSCKOUTEN;
}

/*!
    \brief      configure the LSCKOUT clock source
    \param[in]  lsckout_src: LSCKOUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_LSCKOUTSRC_IRC32K: IRC32K clock selected
      \arg        RCU_LSCKOUTSRC_LXTAL: LXTAL selected
    \param[out] none
    \retval     none
*/
void rcu_lsckout_config(uint32_t lsckout_src)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the LSCKOUTSEL */
    reg &= ~(RCU_BDCTL_LSCKOUTSEL);
    RCU_BDCTL = (reg | lsckout_src);
}

/*!
    \brief      configure PLL clock source
    \param[in]  pll_src: PLL clock source selection
      \arg        RCU_PLLSRC_IRC8M: select IRC8M as PLL source clock
      \arg        RCU_PLLSRC_HXTAL: select HXTAL as PLL source clock
    \param[out] none
    \retval     none
*/
void rcu_pll_source_config(uint32_t pll_src)
{
    /* PLL clock source selection */
    RCU_PLL &= ~(RCU_PLL_PLLSEL);
    RCU_PLL |= pll_src;
}

/*!
    \brief      configure the main PLL clock
    \param[in]  pll_psc: the PLL VCO source clock prescaler
      \arg         this parameter should be selected between 1 and 16. When pll_psc=0, the PLL VCO source clock prescaler close.
    \param[in]  pll_n: the PLL VCO clock multi factor
      \arg        this parameter should be selected between 8 and 180
    \param[in]  pll_p: the PLLP output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected 2,4,6,8
    \param[in]  pll_q: the PLLQ output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 2 and 15
    \param[in]  pll_r: the PLLR output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 2 and 31
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll_config(uint32_t pll_psc, uint32_t pll_n, uint32_t pll_p, uint32_t pll_q, uint32_t pll_r)
{
    ErrStatus status = SUCCESS;

    /* check the function parameter */
    if(CHECK_PLL_PSC_VALID(pll_psc) && CHECK_PLL_N_VALID(pll_n) &&
            CHECK_PLL_P_VALID(pll_p) && CHECK_PLL_Q_VALID(pll_q) &&
            CHECK_PLL_R_VALID(pll_r)) {
        RCU_PLL &= ~(RCU_PLL_PLLPSC | RCU_PLL_PLLN | RCU_PLL_PLLP | RCU_PLL_PLLR);
        RCU_PLL |= (pll_psc -1U) | (pll_n << RCU_PLLNOFFSET) | (((pll_p >> 1U) - 1U) << RCU_PLLPOFFSET) |
                    ((pll_r) << RCU_PLLROFFSET) | ((pll_q) << RCU_PLLROFFSET);
    } else {
        /* set status to ERROR */
        status = ERROR;
    }

    /* return status */
    return status;
}


/*!
    \brief      enable the pllp pllq pllr divider output
    \param[in]  pllx: the output pll enable
      \arg        RCU_PLLP: PLLP divider output enable
      \arg        RCU_PLLQ: PLLQ divider output enable
      \arg        RCU_PLLR: PLLR divider output enable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_enable(uint32_t pllx)
{
    /* PLL divider output enable */
    RCU_PLL |= pllx;
}

/*!
    \brief      disable the pllp pllq pllr divider output
    \param[in]  pllx: the output pll disable
      \arg        RCU_PLLP: PLLP divider output disable
      \arg        RCU_PLLQ: PLLQ divider output disable
      \arg        RCU_PLLR: PLLR divider output disable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_disable(uint32_t pllx)
{
    /* PLL divider output disable */
    RCU_PLL &= ~(pllx);
}

