wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_rcu.c
/*!
    \brief      configure the RTC clock source selection
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV32: CK_HXTAL /32 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = (reg | rtc_clock_source);
}

/*!
    \brief      configure the USARTx (x = 0,1,2) clock source selection
    \param[in]  usart_idx: IDX_USARTx (x = 0,1,2)
    \param[in]  ck_usart: USART clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USARTSRC_APB: CK_USART select CK_APB1(USART1 / USART2) or CK_APB2(USART0)
      \arg        RCU_USARTSRC_CKSYS: CK_USART select CK_SYS
      \arg        RCU_USARTSRC_LXTAL: CK_USART select CK_LXTAL
      \arg        RCU_USARTSRC_IRC8M: CK_USART select CK_IRC8M
    \param[out] none
    \retval     none
*/
void rcu_usart_clock_config(usart_idx_enum usart_idx, uint32_t ck_usart)
{
    switch(usart_idx) {
    case IDX_USART0:
        /* reset the USART0SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART0SEL;
        RCU_CFG1 |= ck_usart;
        break;

    case IDX_USART1:
        /* reset the USART1SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART1SEL;
        RCU_CFG1 |= (uint32_t)ck_usart << 18U;
        break;

    case IDX_USART2:
        /* reset the USART2SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART2SEL;
        RCU_CFG1 |= (uint32_t)ck_usart << 20U;
        break;

    default:
        break;
    }
}

/*!
    \brief      configure the I2Cx (x = 0,1,2,3) clock source selection
    \param[in]  i2c_idx: IDX_I2Cx (x = 0,1,2,3)
    \param[in]  ck_i2c: I2C clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2CSRC_APB1: CK_I2C select CK_APB1
      \arg        RCU_I2CSRC_CKSYS: CK_I2C select CK_SYS
      \arg        RCU_I2CSRC_IRC8M: CK_I2C select CK_IRC8M
    \param[out] none
    \retval     none
*/
void rcu_i2c_clock_config(i2c_idx_enum i2c_idx, uint32_t ck_i2c)
{
    switch(i2c_idx) {
    case IDX_I2C0:
        /* reset the I2C0SEL bits and set according to ck_i2c */
        RCU_CFG2 &= ~RCU_CFG2_I2C0SEL;
        RCU_CFG2 |= ck_i2c ;
        break;

    case IDX_I2C1:
        /* reset the I2C1SEL bits and set according to ck_i2c */
        RCU_CFG2 &= ~RCU_CFG2_I2C1SEL;
        RCU_CFG2 |= (uint32_t)ck_i2c << 2U;
        break;

    case IDX_I2C2:
        /* reset the I2C2SEL bits and set according to ck_i2c */
        RCU_CFG2 &= ~RCU_CFG2_I2C2SEL;
        RCU_CFG2 |= (uint32_t)ck_i2c << 4U;
        break;

    case IDX_I2C3:
        /* reset the I2C4SEL bits and set according to ck_i2c */
        RCU_CFG2 &= ~RCU_CFG2_I2C3SEL;
        RCU_CFG2 |= (uint32_t)ck_i2c << 6U;
        break;

    default:
        break;
    }
}

/*!
    \brief      configure the CANx (x = 0,1,2) clock source selection
    \param[in]  can_idx: IDX_CANx (x = 0,1,2)
    \param[in]  ck_can: CAN clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CANSRC_IRC8M: CK_CAN select CK_IRC8M
      \arg        RCU_CANSRC_APB2: CK_CAN select CK_APB2
      \arg        RCU_CANSRC_PLLQ: CK_CAN select CK_PLLQ
      \arg        RCU_CANSRC_HXTAL: CK_CAN select CK_HXTAL
    \param[out] none
    \retval     none
*/
void rcu_can_clock_config(can_idx_enum can_idx, uint32_t ck_can)
{
    switch(can_idx) {
    case IDX_CAN0:
        /* reset the CAN0SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN0SEL;
        RCU_CFG1 |= ck_can ;
        break;

    case IDX_CAN1:
        /* reset the CAN1SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN1SEL;
        RCU_CFG1 |= (uint32_t)ck_can << 2U;
        break;

    case IDX_CAN2:
        /* reset the CAN2SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN2SEL;
        RCU_CFG1 |= (uint32_t)ck_can << 4U;
        break;

    default:
        break;
    }
}

/*!
    \brief      configure the ADCx (x = 0,1,2,3) clock source selection
    \param[in]  adc_idx: IDX_ADCx (x = 0,1,2,3)
    \param[in]  ck_adc: ADC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCSRC_PLLR: CK_ADC select CK_PLLR
      \arg        RCU_ADCSRC_CKSYS: CK_ADC select CKSYS
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(adc_idx_enum adc_idx, uint32_t ck_adc)
{
    switch(adc_idx) {
    case IDX_ADC0:
    case IDX_ADC1:
    case IDX_ADC2:
        /* reset the ADC012SEL bits and set according to ck_adc */
        RCU_CFG2 &= ~RCU_CFG2_ADC0_1_2SEL;
        RCU_CFG2 |= ck_adc ;
        break;

    case IDX_ADC3:
        /* reset the ADC3SEL bits and set according to ck_adc */
        RCU_CFG2 &= ~RCU_CFG2_ADC3SEL;
        RCU_CFG2 |= (uint32_t)ck_adc << 2U;
        break;

    default:
        break;
    }
}

/*!
    \brief      configure the HPDF clock source selection
    \param[in]  ck_hpdf: HPDF clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFSRC_APB2: CK_HPDF select CK_APB2
      \arg        RCU_HPDFSRC_AHB: CK_HPDF select CK_AHB
    \param[out] none
    \retval     none
*/
void rcu_hpdf_clock_config(uint32_t ck_hpdf)
{
    /* reset the HPDFSEL bits and set according to ck_hpdf */
    RCU_CFG1 &= ~RCU_CFG1_HPDFSEL;
    RCU_CFG1 |= ck_hpdf ;
}

/*!
    \brief      configure the HPDF clock source selection
    \param[in]  ck_hpdfaudio: HPDF clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFAUDIO_PLLQ: CK_HPDFAUDIO select CK_PLLQ
      \arg        RCU_HPDFAUDIO_EHPDFAUDIOPIN: CK_HPDFAUDIO select CK_EHPDFAUDIOPIN
      \arg        RCU_HPDFAUDIO_IRC8M: CK_HPDFAUDIO select IRC8M
    \param[out] none
    \retval     none
*/
void rcu_hpdfaudio_clock_config(uint32_t ck_hpdfaudio)
{
    /* reset the HPDFAUDIOSEL bits and set according to ck_hpdfaudio */
    RCU_CFG1 &= ~RCU_CFG1_HPDFAUDIOSEL;
    RCU_CFG1 |= ck_hpdfaudio ;
}

/*!
    \brief      configure the TRNG prescaler selection
    \param[in]  ck_trng: TRNG clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_TRNG_CKPLLQ_DIVx (x = 2, 3, 4,... , 15): CK_AHB is CKPLLQ/x
    \param[out] none
    \retval     none
*/
void rcu_trng_clock_config(uint32_t ck_trng)
{
    /* reset the RCU_CFG2_TRNGPSC bits and set according to ck_trng */
    RCU_CFG2 &= ~RCU_CFG2_TRNGPSC;
    RCU_CFG2 |= ck_trng;
}

/*!
    \brief      configure the LPTIMER clock source selection
    \param[in]  ck_lptimer: LPTIMER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_LPTIMERSRC_APB1: CK_LPTIMER select CK_APB1
      \arg        RCU_LPTIMERSRC_IRC32K: CK_LPTIMER select CK_IRC32K
      \arg        RCU_LPTIMERSRC_LXTAL: CK_LPTIMER select CK_LXTAL
      \arg        RCU_LPTIMERSRC_IRC8M: CK_LPTIMER select CK_IRC8M
    \param[out] none
    \retval     none
*/
void rcu_lptimer_clock_config(uint32_t ck_lptimer)
{
    /* reset the LPTIMERSEL bits and set according to ck_lptimer */
    RCU_CFG2 &= ~RCU_CFG2_LPTIMERSEL;
    RCU_CFG2 |= ck_lptimer;
}

/*!
    \brief      configure the QSPI clock source selection
    \param[in]  ck_qspi: QSPI clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_QSPISRC_CKSYS: CK_QSPI select CK_CKSYS
      \arg        RCU_QSPISRC_IRC8M: CK_QSPI select CK_IRC8M
      \arg        RCU_QSPISRC_PLLQ: CK_QSPI select CK_PLLQ
    \param[out] none
    \retval     none
*/
void rcu_qspi_clock_config(uint32_t ck_qspi)
{
    /* reset the QSPISEL bits and set according to ck_lptimer */
    RCU_CFG2 &= ~RCU_CFG2_QSPISEL;
    RCU_CFG2 |= ck_qspi;
}

/*!
    \brief      configure the HRTIMER clock source selection
    \param[in]  hrtimer_clock_source: HRTIMER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HRTIMERSRC_CKAPB2: APB2 clock selected as HRTIMER source clock
      \arg        RCU_HRTIMERSRC_CKSYS: system clock selected as HRTIMER source clock 
    \param[out] none
    \retval     none
*/
void rcu_hrtimer_clock_config(uint32_t hrtimer_clock_source)
{
    uint32_t reg;
    
    reg = RCU_CFG2; 
    /* reset the HRTIMERSEL bit and set according to hrtimer_clock_source */
    reg &= ~RCU_CFG2_HRTIMERSEL;
    RCU_CFG2 = (reg | hrtimer_clock_source);
}

/*!
    \brief      configure the LXTAL drive capability
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: low driving capability
      \arg        RCU_LXTAL_MEDDRI: medium driving capability
      \arg        RCU_LXTAL_HIGHDRI: high driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

    reg = RCU_BDCTL;

    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    reg &= ~RCU_BDCTL_LXTALDRI;
    RCU_BDCTL = (reg | lxtal_dricap);
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC8M: IRC8M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_PLL_CK: PLL
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }

        break;

